Revit 2027 API
SpecTypeId.PipingTemperatureDifference Property
 Temperature Difference, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingTemperatureDifference { get; }
Public Shared ReadOnly Property PipingTemperatureDifference As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingTemperatureDifference {
	ForgeTypeId^ get ();
}
static member PipingTemperatureDifference : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace